In [ ]:
# use groupby() method of a data.frame and ngroup() to add an id to each row.

In [4]:
import numpy as np
import pandas as pd

In [39]:
df = pd.DataFrame(np.random.randint(low = 2, size =(6, 2)) )

In [40]:
df['new_id'] = df.groupby(df.columns.tolist(), sort=False).ngroup() + 1

In [41]:
df

   0  1  new_id
0  1  1       1
1  0  0       2
2  1  1       1
3  0  1       3
4  1  1       1
5  1  0       4

In [42]:
groups = df.groupby(df.columns.tolist(), sort=False)

In [43]:
groups.groups

{(0, 0, 2): Int64Index([1], dtype='int64'),
 (0, 1, 3): Int64Index([3], dtype='int64'),
 (1, 0, 4): Int64Index([5], dtype='int64'),
 (1, 1, 1): Int64Index([0, 2, 4], dtype='int64')}

In [44]:
groups.get_group((0,0, 2))

   0  1  new_id
1  0  0       2